barbecue: dict[str, str] = {'/recipes':
                            '''
<code>Шашлык из свинины (лучший маринад)</code>
<code>Шашлык из свинины 'Быстрый</code>
<code>Овощи на мангале</code>
<code>Свиные ребрышки</code>
<code>Говядина в соевом соусе</code>
<code>Плов</code>
                            '''
                            }

LEXICON: dict[str, str] = {
    'but_1': "Шашлык из свинины (лучший маринад):",
    'but_2': "Шашлык из свинины 'Быстрый':",
    'but_3': "Овощи на мангале:",
    'but_4': "Свиные ребрышки:",
    'but_5': "Говядина в соевом соусе:",
    'but_6': "Плов",
}


LEXICON_COMMANDS_RU: dict[str, str] = {

    '/help': '<i><b><u>Это бот</u></b></i>',
    '/recipes': 'список рецептов',
    '/support': 'Поддержка',
    '/contacts': 'Другие способы связи',
    '/payments': 'Платежи',
    '/pay_bay': '<tg-spoiler>Помаши денежкам рукой</tg-spoiler>'

}
