Recipesnt: dict[str, str] = {
    "Шашлык из свинины (лучший маринад):":
    """
Свинина - 1,5 кг,
Лук репчатый маленький - 10-12 шт.
Помидор крупный - 1 шт.
Лимон - 0,5 шт.
Соль - 1 ч. л.
Перец молотый - 1 ч. л.

Приготовление:                           
Подготовить продукты для шашлыка из свинины.
Лук нарезать кольцами, помидоры нарезать кружочками.
Мясо промыть и обсушить. Нарезать небольшими кусочками, размером со спичечный коробок.
Уложить на дно емкости слой мяса, сверху посолить, поперчить.
Выложить на свинину кольца лука.
На лук выложить кружочки помидора. Сбрызнуть лимоном.
Повторять процедуру, пока не будет уложено все мясо.
Накрыть и убрать свинину с луком и помидорами мариноваться в холодильник минимум на 8 часов. Можно
периодически встряхивать емкость, чтобы соки равномерно распределились и мясо лучше замариновалось.
Пожарить шашлык из свинины на мангале.
""",

    "Шашлык из свинины 'Быстрый':":
    """
Продукты (на 2 порции)
Свинина (шея) - 300 г
Лук - 2 шт.
Перец болгарский - 1 шт.
Уксус - 1-2 ст. ложки
Cахар - 1 ст. ложка
Соль - 0,25 ч. ложки
Перец черный молотый - 0,25-0,5 ч. ложки

Приготовление:
Мясо помыть, обсушить.
Нарезать острым ножом мясо на кусочки.
Лук репчатый почистить, помыть, нарезать тонкими кольцами.
Чеснок почистить, раздавить в чесночнице.
Мясо сложить в миску.
К мясу добавить лук репчатый.'
Посыпать специями и перцем. Сбрызнуть лимонным соком.
Смешать горчицу, чеснок, сахар, соевый соус. Добавить к мясу.
Все тщательно перемешать. Накрыть мясо крышкой.
Мариновать 2-8 часов в холодильнике. Шашлыки жарить любым способом.
""",
    "Овощи на мангале:":
    """
4 баклажана, 
500 г грибов, 
3 кабачка, 
4 перца, 
4 помидора, 
2 луковицы, 
специи, 
оливковое масло.

Приготовление: 
Нарежь все овощи довольно крупными кусками, 
сбрызни маслом и приправь. 
Выложи их на решетку или произвольно надень на шампуры, 
и запекай на мангале около 15-20 минут.
""",

    "Свиные ребрышки:":
    """
2,5 кг свиных ребрышек, 
1 стакан кетчупа, 
0,5 стакана гранатового сока, 
2 ст.л. винного уксуса, 
2 ст.л. меда, 
4 ст.л. растительного масла, 
чеснок, специи.

Приготовление: 
Очисти ребрышки и нарежь порционными кусками. 
Смешай все остальные ингредиенты в однородный маринад и залей им ребрышки минимум на 3 часа, а лучше на ночь. 
Готовь на решетке около получаса.
""",

    "Говядина в соевом соусе:":
    """
1 кг говядины, 
100 мл соевого соуса, 
4 луковицы, 
200 г помидоров, 
2 зубчика чеснока, 
50 мл растительного масла, 
специи.

Приготовление: 
Нарежь говядину, чеснок и лук, а помидоры очисти и натри на терке. 
Добавь соевый соус, масло и специи, перемешай все и оставь в холодильнике на 8 часов. 
Жарь мясо на мангале 20 минут.
""",

    "Плов":
    """
2 кг мяса, 
1 кг риса, 
1 кг лука, 
1 кг моркови, 
1 ст.л. барбариса, 
1 ч.л. зиры, 
4 головки чеснока, 
1 стакан растительного масла, 
2,5 л воды, 
специи.

Приготовление: 
Установи казан на решетку, доведи до кипения масло и обжарь мясо, помешивая. 
Добавь крупно нарезанную морковь, а через пару минут лук.
Когда овощи будут готовы, добавь специи и целые зубчики чеснока. 
Залей все водой, добавь рис, вставь в него оставшийся чеснок и готовь 
плов в казане под крышкой примерно 20 минут. Сними казан с углей и дай настояться.
""",
}
# print(Recipesnt.keys())
